Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/edc/PIC32MK0512GPH064.PIC
      <edc:SFRDef edc:_addr="0x1F8606B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnnnnnnnn----nn" edc:cname="CNFG" edc:desc="" edc:impl="0xffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000----00" edc:name="CNFG" edc:nzwidth="32" edc:por="----------------0000000000----00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFG0" edc:mask="0x1" edc:name="CNFG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG1" edc:mask="0x1" edc:name="CNFG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFG6" edc:mask="0x1" edc:name="CNFG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG7" edc:mask="0x1" edc:name="CNFG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG8" edc:mask="0x1" edc:name="CNFG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG9" edc:mask="0x1" edc:name="CNFG9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG10" edc:mask="0x1" edc:name="CNFG10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG11" edc:mask="0x1" edc:name="CNFG11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG12" edc:mask="0x1" edc:name="CNFG12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG13" edc:mask="0x1" edc:name="CNFG13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG14" edc:mask="0x1" edc:name="CNFG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFG15" edc:mask="0x1" edc:name="CNFG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8606C0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8606D0" edc:offset="16"/>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f880000" edc:endaddr="0x1f88B000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb5_std">
      <edc:SFRDef edc:_addr="0x1F880000" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:access="nnnnsnnnrrrnnnnnn-nnrnnnnnnnnnnn" edc:cname="CFD1CON" edc:desc="" edc:grp="CAN1" edc:impl="0xffffbfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuu01001000uuuu0-0u0uuuuuu00000" edc:name="CFD1CON" edc:nzwidth="0x20" edc:por="xxxx01001000xxxx0-0x0xxxxxx00000" edc:portals="CLR SET INV" ltx:baseofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DNCNT" edc:desc="" edc:mask="0x1f" edc:name="DNCNT" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="ISOCRCEN" edc:mask="0x1" edc:name="ISOCRCEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PXEDIS" edc:mask="0x1" edc:name="PXEDIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKSEL0" edc:mask="0x1" edc:name="CLKSEL0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKFIL" edc:mask="0x1" edc:name="WAKFIL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WFT" edc:mask="0x3" edc:name="WFT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:desc="" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BRSDIS" edc:mask="0x1" edc:name="BRSDIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RTXAT" edc:mask="0x1" edc:name="RTXAT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ESIGM" edc:mask="0x1" edc:name="ESIGM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERR2LOM" edc:mask="0x1" edc:name="SERR2LOM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STEF" edc:mask="0x1" edc:name="STEF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXQEN" edc:desc="" edc:mask="0x1" edc:name="TXQEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPMOD" edc:desc="" edc:mask="0x7" edc:name="OPMOD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TXBWS" edc:mask="0xf" edc:name="TXBWS" edc:nzwidth="0x4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CAN1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F880010" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnn-nnnnnnn-nnnnnnn" edc:cname="CFD1NBTCFG" edc:desc="" edc:impl="0xffff7f7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu-uuuuuuu-uuuuuuu" edc:name="CFD1NBTCFG" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxx-xxxxxxx-xxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SJW" edc:mask="0x7f" edc:name="SJW" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TSEG2" edc:mask="0x7f" edc:name="TSEG2" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TSEG1" edc:mask="0xff" edc:name="TSEG1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="BRP" edc:mask="0xff" edc:name="BRP" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F880020" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="1" edc:access="nnnnnnnn---nnnnn----nnnn----nnnn" edc:cname="CFD1DBTCFG" edc:desc="" edc:impl="0xff1f0f0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu---uuuuu----uuuu----uuuu" edc:name="CFD1DBTCFG" edc:nzwidth="32" edc:por="xxxxxxxx---xxxxx----xxxx----xxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SJW" edc:mask="0xf" edc:name="SJW" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TSEG2" edc:mask="0xf" edc:name="TSEG2" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TSEG1" edc:mask="0x1f" edc:name="TSEG1" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BRP" edc:mask="0xff" edc:name="BRP" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
